In [90]:
import mysql.connector as connector
import pandas as pd
import datetime as dt

In [91]:
# Make a connection:
try:

    connection = connector.connect(user= 'root' , password = '******' )
    print('Connected...')

except connector.Error as err:

    print('Error code: ', err.errno)
    print('Error message: ', err.msg)

Connected...

In [92]:
# Create the cursor:

if connection.is_connected():
    cursor = connection.cursor(buffered=True)
    print('cursor ready...')
else:
    print("It is not possible to create the cursor!" )

cursor ready...

In [93]:
# Set the database to work with:

cursor.execute('USE meta_py_to_mysql')
print('The database is setted to: ', connection.database)

The database is setted to:  meta_py_to_mysql

In [94]:
# See all the tables in the database:
cursor.execute('SHOW TABLES')
for i in cursor:
    print(i)

('bookings',)
('menu_items',)
('menus',)
('orders',)

In [8]:
# Deep look into bookings table:

cursor.execute('SELECT * FROM bookings')
result1 = cursor.fetchall()
columns1 = cursor.column_names

df1 = pd.DataFrame(data=result1, columns=columns1)
df1

   bookingID  tableNo guestFirstName guestLastName     bookingSlot  employeeID
0          1       12           Anna       Iversen 0 days 19:00:00           1
1          2       12         Joakim       Iversen 0 days 19:00:00           1
2          3       19        Vanessa      McCarthy 0 days 15:00:00           3
3          5        5         Hiroki        Yamane 0 days 18:30:00           2
4          6       10          Diana         Pinto 0 days 20:00:00           4

In [24]:
# Get all the booking slots from database and add 1 hour to then:

cursor.execute('SELECT * FROM bookings')

for row in cursor: # It runs in each 
    booking_id = row[0]
    booking_slot = row[4]
    new_booking_slot = booking_slot + dt.timedelta(hours=1) #timedelta adds some choosed time
    print(f'booking id {booking_id} is moved from {booking_slot} to {new_booking_slot}')

booking id 1 is moved from 19:00:00 to 20:00:00
booking id 2 is moved from 19:00:00 to 20:00:00
booking id 3 is moved from 15:00:00 to 16:00:00
booking id 5 is moved from 18:30:00 to 19:30:00
booking id 6 is moved from 20:00:00 to 21:00:00

In [96]:
# Convert hour from database to python and print:

cursor.execute("""SELECT 
TableNo, 
GuestFirstName, 
GuestLastName, 
BookingSlot 
FROM Bookings 
ORDER BY BookingSlot;""")

results8 = cursor.fetchall()

print("The guests and their booking slots are:\n")
for result in results8: 
    time = str(result[3]) # convert from database to python string
    hour = dt.datetime.strptime(time,'%H:%M:%S').hour # get the hour
    minute = dt.datetime.strptime(time,'%H:%M:%S').minute # get the minute
    print("[Table no:]",result[0],">>",result[1],result[2], "is expected to arrive at:", # print
          hour,"hrs and", minute, "mins")

The guests and their booking slots are:

[Table no:] 19 >> Vanessa McCarthy is expected to arrive at: 15 hrs and 0 mins
[Table no:] 5 >> Hiroki Yamane is expected to arrive at: 18 hrs and 30 mins
[Table no:] 12 >> Anna Iversen is expected to arrive at: 19 hrs and 0 mins
[Table no:] 12 >> Joakim Iversen is expected to arrive at: 19 hrs and 0 mins
[Table no:] 10 >> Diana Pinto is expected to arrive at: 20 hrs and 0 mins

In [98]:
#  Add 1 hour to the booking with ID of 2 in SQL form:

cursor.execute("""SELECT 
BookingID, 
TableNo, 
BookingSlot, 
ADDTIME(BookingSlot,"1:00:00") as NewTime 
FROM Bookings
WHERE TableNo = 12 AND BookingID = 2;""")

results9 = cursor.fetchall()

print("Booking time change ALERT!!")
for result in results9:  
    print("Booking ID:",result[0])
    print("Table number:",result[1])
    print("Booked slot:",result[2])
    print("New arrival time:",result[3])

Booking time change ALERT!!
Booking ID: 2
Table number: 12
Booked slot: 19:00:00
New arrival time: 20:00:00

In [25]:
# Deep look into orders table:

cursor.execute('SELECT * FROM orders')
result2 = cursor.fetchall()
columns2 = cursor.column_names

df2 = pd.DataFrame(data=result2, columns=columns2)
df2

   orderID  tableNo  menuID  bookingID  billAmount  quantity
0        1       12       1          1           2        86
1        2       19       2          2           1        37
2        3       15       2          3           1        37
3        4        5       3          4           1        40
4        5        8       1          5           1        43

In [38]:
# Use of the function SUM():

cursor.execute("""SELECT SUM(billAmount) AS total_sale FROM orders """)
result3 = cursor.fetchone()
columns3 = cursor.column_names

print(columns3[0], ' = ', result3[0])

total_sale  =  6

In [68]:
# Use of the function HOUR() to extract only the hour from the bookingSlot column:

cursor.execute("""SELECT bookingID, HOUR(bookingSlot) FROM bookings""")
result4 = cursor.fetchall()
columns4 = cursor.column_names

df3 = pd.DataFrame(data=result4, columns=columns4)
df3.style.hide(axis='index')

In [60]:
# Use upper() and concat() to get the guests complete name in uppercase:

cursor.execute("""SELECT bookingID, UPPER(CONCAT(guestFirstName,' ' ,guestLastName)) AS name FROM bookings""")
result5 = cursor.fetchall()
columns5 = cursor.column_names

df4 = pd.DataFrame(data=result5, columns=columns5)
df4.style.hide(axis='index')

In [74]:
# Varios outputs in the same dataframe
"""
- Number of bookings
- Total sale
- Average sale
"""
cursor.execute("""SELECT COUNT(*) AS n_bookings FROM bookings""")
n_bookings = cursor.fetchone()

cursor.execute("""SELECT SUM(billAmount) FROM orders""")
total_sale = cursor.fetchone()

cursor.execute("""SELECT AVG(billAmount) FROM orders""")
avg_sale = cursor.fetchone()

print('Today statistics:')
print('Number of bookings: ',n_bookings[0])
print('Total sale: ', total_sale[0])
print('Average sale: ', avg_sale[0])

Today statistics:
Number of bookings:  5
Total sale:  6
Average sale:  1.2000

In [83]:
# Varios outputs in the same dataframe:
"""
- Number of bookings
- Total sale
- Average sale
"""
cursor.execute("""SELECT 
COUNT(bookingID) AS n_bookings,
SUM(billAmount) AS total_sale,
AVG(billAmount) AS avg_sale
FROM orders;""")

results = cursor.fetchall()[0]

print('Today statistics:')
print('Number of bookings: ',results[0])   
print('Total sale: ', results[1])
print('Average sale: ', results[2])

Today statistics:
Number of bookings:  5
Total sale:  6
Average sale:  1.2000

In [87]:
# Count the number of bookings for each table:

cursor.execute("""SELECT tableNo AS 'table_number',
COUNT(tableNo) AS 'n_bookings' 
FROM bookings 
GROUP BY tableNo 
ORDER BY n_bookings DESC;""")

result6 = cursor.fetchall()
columns6 = cursor.column_names

df6 = pd.DataFrame(data=result6, columns=columns6)
df6.style.hide(axis='index')

In [88]:
'''
Modify the table bookings replacing the booking slot time with:

* Late afternoon: for hours 15 and 16  
* Evening: for hours 17 and 18 
* Night: for hours 19 and 20 

'''

sql_query="""
SELECT
BookingID,
CONCAT(GuestFirstName,' ',GuestLastName) AS Guest_Name,

CASE
WHEN HOUR(BookingSlot) IN (15,16) THEN "Late afternoon" 
WHEN HOUR(BookingSlot) IN (17,18) THEN "Evening" 
WHEN HOUR(BookingSlot) IN (19,20) THEN "Night"
ELSE "Time not available" 
END AS Arrival_slot

FROM Bookings;"""

cursor.execute(sql_query)
result7 = cursor.fetchall()
columns7 = cursor.column_names

df7 = pd.DataFrame(data=result7,columns=columns7)
df7.style.hide(axis='index')

In [89]:
# Close the connection:

if connection.is_connected():
    cursor.close()
    print('Cursor closed...')
    connection.close()
    print('Disconnected...')
else:
    print('Already disconnected')

Cursor closed...
Disconnected...